import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["PropID","Name","GeneratePoint","Time","Num"],["","","","",""],[9997,"道具收集目标",null,0,5,"",null,""],[9998,"道具生成数量",null,0,6,"",null,""],[9999,"道具刷新间隔",null,10,0,"","",""],[10000,"地图1湖边别墅",null,0,20,"","",""],[10001,"道具刷新点1",new mw.Vector(-2152,-693,-20),0,0],[10002,"道具刷新点2",new mw.Vector(-2351,857,-20),0,0],[10003,"道具刷新点3",new mw.Vector(471,-1066,-20),0,0],[10004,"道具刷新点4",new mw.Vector(1166,1289,-20),0,0],[10005,"道具刷新点5",new mw.Vector(2199,-796,-20),0,0],[10006,"道具刷新点6",new mw.Vector(3178,319,-20),0,0],[10007,"道具刷新点7",new mw.Vector(2278,1024,-20),0,0],[10008,"道具刷新点8",new mw.Vector(3155,-1190,-20),0,0],[10009,"道具刷新点9",new mw.Vector(1000,290,-20),0,0],[10010,"道具刷新点10",new mw.Vector(-731,-353,-20),0,0],[10011,"道具刷新点11",new mw.Vector(-1435,-1406,-20),0,0],[10012,"道具刷新点12",new mw.Vector(-1140,1505,-20),0,0],[10013,"道具刷新点13",new mw.Vector(-3232,1321,-20),0,0],[10014,"道具刷新点14",new mw.Vector(-2849,-1730,-20),0,0],[10015,"道具刷新点15",new mw.Vector(-3280,-18,-20),0,0],[10016,"道具刷新点16",new mw.Vector(-4566,-148,-20),0,0],[10017,"道具刷新点17",new mw.Vector(-4476,1171,-20),0,0],[10018,"道具刷新点18",new mw.Vector(-3834,717,-20),0,0],[10019,"道具刷新点19",new mw.Vector(-3822,-828,-20),0,0],[10020,"道具刷新点20",new mw.Vector(-4182,-1705,-20),0,0],[20000,"地图2XXXX",null,0,20],[20001,"道具刷新点1",new mw.Vector(-2152,-693,-20),0,0],[20002,"道具刷新点2",new mw.Vector(-2351,857,-20),0,0],[20003,"道具刷新点3",new mw.Vector(471,-1066,-20),0,0],[20004,"道具刷新点4",new mw.Vector(1166,1289,-20),0,0],[20005,"道具刷新点5",new mw.Vector(2199,-796,-20),0,0],[20006,"道具刷新点6",new mw.Vector(3178,319,-20),0,0],[20007,"道具刷新点7",new mw.Vector(2278,1024,-20),0,0],[20008,"道具刷新点8",new mw.Vector(3155,-1190,-20),0,0],[20009,"道具刷新点9",new mw.Vector(1000,290,-20),0,0],[20010,"道具刷新点10",new mw.Vector(-731,-353,-20),0,0],[20011,"道具刷新点11",new mw.Vector(-1435,-1406,-20),0,0],[20012,"道具刷新点12",new mw.Vector(-1140,1505,-20),0,0],[20013,"道具刷新点13",new mw.Vector(-3232,1321,-20),0,0],[20014,"道具刷新点14",new mw.Vector(-2849,-1730,-20),0,0],[20015,"道具刷新点15",new mw.Vector(-3280,-18,-20),0,0],[20016,"道具刷新点16",new mw.Vector(-4566,-148,-20),0,0],[20017,"道具刷新点17",new mw.Vector(-4476,1171,-20),0,0],[20018,"道具刷新点18",new mw.Vector(-3834,717,-20),0,0],[20019,"道具刷新点19",new mw.Vector(-3822,-828,-20),0,0],[20020,"道具刷新点20",new mw.Vector(-4182,-1705,-20),0,0],[30000,"地图3XXXX",null,0,20],[30001,"道具刷新点1",new mw.Vector(-2152,-693,-20),0,0],[30002,"道具刷新点2",new mw.Vector(-2351,857,-20),0,0],[30003,"道具刷新点3",new mw.Vector(471,-1066,-20),0,0],[30004,"道具刷新点4",new mw.Vector(1166,1289,-20),0,0],[30005,"道具刷新点5",new mw.Vector(2199,-796,-20),0,0],[30006,"道具刷新点6",new mw.Vector(3178,319,-20),0,0],[30007,"道具刷新点7",new mw.Vector(2278,1024,-20),0,0],[30008,"道具刷新点8",new mw.Vector(3155,-1190,-20),0,0],[30009,"道具刷新点9",new mw.Vector(1000,290,-20),0,0],[30010,"道具刷新点10",new mw.Vector(-731,-353,-20),0,0],[30011,"道具刷新点11",new mw.Vector(-1435,-1406,-20),0,0],[30012,"道具刷新点12",new mw.Vector(-1140,1505,-20),0,0],[30013,"道具刷新点13",new mw.Vector(-3232,1321,-20),0,0],[30014,"道具刷新点14",new mw.Vector(-2849,-1730,-20),0,0],[30015,"道具刷新点15",new mw.Vector(-3280,-18,-20),0,0],[30016,"道具刷新点16",new mw.Vector(-4566,-148,-20),0,0],[30017,"道具刷新点17",new mw.Vector(-4476,1171,-20),0,0],[30018,"道具刷新点18",new mw.Vector(-3834,717,-20),0,0],[30019,"道具刷新点19",new mw.Vector(-3822,-828,-20),0,0],[30020,"道具刷新点20",new mw.Vector(-4182,-1705,-20),0,0]];
export interface IPropsGenerateElement extends IElementBase{
 	/**道具序号*/
	PropID:number
	/**名称*/
	Name:string
	/**生成点坐标*/
	GeneratePoint:mw.Vector
	/**刷新时间（秒）*/
	Time:number
	/**数量*/
	Num:number
 } 
export class PropsGenerateConfig extends ConfigBase<IPropsGenerateElement>{
	constructor(){
		super(EXCELDATA);
	}

}