import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Guid","Describe","Type","Count","Rate","InnerRadius","FalloffDistance"],["","","","","","","",""],[10001,"134704","玩家脚步","2",0,3,400,1000],[10002,"14245","拾取金币","2",1,2,200,600],[10003,"120839","落地音效","2",1,1,200,600],[10004,"117609","随机身份-凶手确认音效","1",1,1,0,0],[10005,"75354","随机身份-侦探确认音效","1",1,1,0,0],[10006,"12694","随机身份-学生确认音效","1",1,1,0,0],[10007,"117609","死亡音效（被刀）","2",1,3,400,4000],[10008,"27955","胜利展示BGM","0",1,1,0,0],[10009,"146244","进入大厅前音乐","3",0,1,0,0],[10010,"185618","大厅音乐","4",0,1,0,0],[10011,"185618","大厅音乐","4",0,1,0,0],[10012,"148621","地图1音乐","5",0,1,0,0],[10013,"148627","地图2音乐","7",0,1,0,0],[10014,"148643","地图2音乐","7",0,1,0,0],[10015,"148644","地图3音乐","6",0,1,0,0],[10016,"148645","地图3音乐","6",0,1,0,0],[10017,"148646","地图3音乐","6",0,1,0,0],[10018,"148647","地图3音乐","6",0,1,0,0],[10019,"148650","地图3音乐","6",0,1,0,0],[10020,"14026","开枪时的音效","2",1,3,200,600],[10021,"12616","换弹时的音效","2",1,6,200,600],[10022,"27468","投掷飞刀的音效","2",1,3,200,600],[10023,"14182","子弹成功命中音效","2",1,3,200,600],[10024,"117609","投掷飞刀的命中音效","2",1,3,400,4000],[10025,"184562","消灭额外音效","1",1,1,0,0],[10026,"122569","爆炸飞刀爆炸音效","2",1,6,400,2000],[10027,"157471","成功购买/激活","1",1,3,0,0],[10028,"116336","购买/激活失败","1",1,3,0,0]];
export interface ISoundElement extends IElementBase{
 	/**资源ID*/
	ID:number
	/**资源GUID*/
	Guid:string
	/**描述（可不填，供参考）*/
	Describe:string
	/**类型：
0：BGM
1：客户端
2：3D
3：进入大厅前音乐
4：大厅音乐
5：地图1音乐
6：地图2音乐
7：地图3音乐
0：胜利bgm*/
	Type:string
	/**播放次数（0是无限循环）*/
	Count:number
	/**音量调节*/
	Rate:number
	/**（3D独有）内部半径(默认值200)*/
	InnerRadius:number
	/**（3D独有）衰减距离(默认值600)*/
	FalloffDistance:number
 } 
export class SoundConfig extends ConfigBase<ISoundElement>{
	constructor(){
		super(EXCELDATA);
	}

}